1
2
3
a
aaron
abarim
abated
abdon
abed-nego
abel
abhor
abhorred
abhorreth
abiathar
abib
abidan
abide
abideth
abiding
abiezer
abigail
abihail
abihu
abijah
abijam
ability
abimelech
abinadab
abiram
abishag
abishai
abishua
able
abner
abode
abolished
abominable
abomination
abominations
abound
about
above
abraham
abram
abroad
absalom
absent
abstain
abundance
abundantly
abyss
acacia
accept
acceptable
accepted
accomplish
accomplished
accord
according
account
accounted
accursed
accusation
accuse
accused
achaia
achan
achbor
achish
achor
achsah
acknowledge
acquaintance
act
acts
adah
adaiah
adam
adar
add
added
addeth
adjure
admah
admonish
adonijah
adoption
adorned
adullam
adulterers
adulteress
adulteries
adultery
advanced
advantage
adversaries
adversary
adversity
afar
affairs
afflict
afflicted
affliction
afflictions
affrighted
afore
aforetime
afraid
after
afterward
afterwards
agag
agagite
again
against
age
aged
ages
ago
agree
agreed
agrippa
ah
aha
ahab
ahasuerus
ahaz
ahaziah
ahiezer
ahijah
ahikam
ahilud
ahimaaz
ahimelech
ahinoam
ahio
ahira
ahithophel
ahitub
ahohite
ai
aiah
aijalon
aileth
ain
air
akkub
alarm
alas
alexander
alien
alienated
alike
alive
all
almighty
almond-blossoms
almost
alms
alone
along
aloof
aloud
alphaeus
already
also
altar
altars
although
altogether
alway
always
am
amalek
amalekite
amalekites
amariah
amasa
amasai
amazed
amaziah
ambassadors
ambush
amen
amend
amiss
ammiel
ammihud
amminadab
ammishaddai
ammon
ammonite
ammonites
amnon
amon
among
amorite
amorites
amos
amoz
amram
an
anah
anak
anakim
ananias
anathema
anathoth
ancient
and
andrew
angel
angels
anger
angry
anguish
anoint
anointed
anointing
another
answer
answerable
answered
answerest
answereth
answering
antioch
anxious
any
anything
apart
aphek
apiece
apollos
apostle
apostles
apparel
appear
appearance
appeared
appeareth
appearing
appetite
apple
apply
appoint
appointed
approach
approved
aquila
ar
arabah
arabia
arabians
arad
aram
araunah
archers
arches
archite
ard
are
argob
ariel
aright
arioch
arise
ariseth
aristarchus
ark
arm
armed
armies
armour
armourbearer
arms
army
arnon
aroer
arose
arpachshad
arpad
array
arrayed
arrogancy
arrow
arrows
art
artaxerxes
as
asa
asahel
asaiah
asaph
ascend
ascended
ascent
ascents
ashamed
ashdod
asher
asherah
asherim
ashes
ashkelon
ashtaroth
asia
aside
ask
asked
asketh
asking
asleep
ass
assayed
assemble
assembled
assemblies
assembly
asses
asshur
assurance
assured
assuredly
assyria
assyrian
assyrians
astonied
astonished
astonishment
astray
asunder
at
ate
ater
athaliah
athens
athirst
atonement
attain
attained
attend
audience
aught
augury
authority
avenge
avenged
avenger
awake
awaked
away
awe
awoke
axe
axes
azarel
azariah
azekah
azel
azmaveth
azrikam
baal
baal-hanan
baal-peor
baalah
baalim
baanah
baasha
babe
babes
babylon
back
backs
backsliding
backward
bad
bade
bag
bahurim
bake
baken
baker
balaam
balak
balance
balances
bald
baldness
balm
band
bands
bani
bank
banks
banquet
baptism
baptist
baptize
baptized
baptizing
bar
barabbas
barak
bare
barley
barnabas
barns
barren
bars
baruch
barzillai
base
basemath
bases
bashan
basket
baskets
basons
bath
bath-sheba
bathe
baths
battle
battles
bay
be
beach
beam
beams
bear
beard
bearest
beareth
bearing
beast
beasts
beat
beaten
beating
beautiful
beauty
bebai
became
because
becher
become
becometh
bed
bedchamber
beds
beelzebub
been
beer-sheba
beeroth
beeves
befall
befallen
before
beforehand
beforetime
began
begat
beget
begin
beginning
begotten
beguiled
begun
behalf
behaved
behaviour
beheaded
beheld
behind
behold
beholdest
beholdeth
beholding
being
bela
belial
believe
believed
believest
believeth
believing
belly
belong
belonged
belongeth
belonging
beloved
belshazzar
belteshazzar
bemoan
ben-hadad
benaiah
bend
beneath
benjamin
benjamite
benjamites
bent
beor
bereave
bereaved
berechiah
beriah
beryl
beseech
beset
beside
besides
besiege
besieged
besought
best
bestow
bestowed
beth-aven
beth-el
beth-horon
beth-lehem
beth-lehem-judah
beth-shean
beth-shemesh
bethany
bethlehem
bethsaida
bethuel
betray
betrayed
betrothed
better
between
betwixt
beware
beyond
bezalel
bezer
bichri
bid
bidden
bigvai
bildad
bilhah
bill
bind
bindeth
binding
binnui
bird
birds
birth
birthright
bite
bitter
bitterly
bitterness
black
blackness
blade
blameless
blaspheme
blasphemed
blasphemeth
blasphemies
blasphemy
blast
blasting
blemish
bless
blessed
blesseth
blessing
blessings
blew
blind
blindness
blood
bloodguiltiness
bloodthirsty
bloody
blossom
blot
blotted
blow
blowing
blown
blue
board
boards
boast
boat
boats
boaz
bodies
body
boil
bold
boldly
boldness
bolts
bond
bondage
bondman
bondmen
bonds
bondservant
bondservants
bone
bones
book
books
booths
border
borders
born
borne
borrow
bosom
both
bottle
bottom
bough
boughs
bought
bound
bounds
bountifully
bounty
bow
bowed
bowels
bowl
bowls
bows
boy
bozrah
bracelets
brake
brakest
branch
branches
brasen
brass
breach
breaches
bread
breadth
break
breaketh
breaking
breast
breastplate
breasts
breath
breathed
breeches
brethren
brick
bricks
bride
bridegroom
bridle
briers
bright
brightness
brim
brimstone
bring
bringeth
bringing
brink
broad
broidered
broken
brook
brooks
brother
brought
broughtest
bruised
brutish
buckler
bucklers
bud
budded
build
builded
builders
buildest
buildeth
building
built
bukki
bullock
bullocks
bulls
bulwarks
burden
burdens
burial
buried
burn
burned
burneth
burning
burnished
burnt
burst
bury
burying
buryingplace
bush
business
but
butler
butter
buy
by
byword
caesar
caesarea
caiaphas
cain
cake
cakes
calamity
caldron
caleb
calf
call
called
calledst
calleth
calling
calm
calves
came
camel
camels
camest
camp
camps
can
canaan
canaanite
canaanites
candlestick
candlesticks
cankerworm
cannot
canst
capernaum
captain
captains
captive
captives
captivity
carcase
carcases
care
careful
carefully
careless
careth
carmel
carmelite
carmi
carnal
carpenters
carried
carry
carrying
cart
carved
case
cast
casteth
casting
castle
castles
catch
caterpiller
cattle
caught
caul
cause
caused
causes
causeth
cave
caves
cease
ceased
ceaseth
cedar
cedars
censer
censers
centurion
cephas
certain
certainly
certainty
chaff
chain
chains
chaldea
chaldeans
chamber
chamberlain
chamberlains
chambers
chance
change
changed
changes
channels
chapiter
chapiters
charge
charged
charger
charges
charging
chariot
chariots
chase
chased
chasten
chastened
chasteneth
chastening
chastise
chastised
chebar
chedorlaomer
cheek
cheeks
cheer
cheerful
chemosh
chenaanah
cherethites
cherub
cherubim
chest
cheweth
chief
chiefest
chiefs
child
childless
children
choice
choked
choose
chose
chosen
christ
chronicles
church
churches
cilicia
circuit
circumcise
circumcised
circumcision
cistern
cisterns
cities
city
clad
clap
clasps
clave
clay
clean
cleanness
cleanse
cleansed
cleansing
clear
cleave
cleaveth
cleft
clefts
climb
clods
cloke
close
closed
cloth
clothe
clothed
clothes
clothing
cloths
cloud
clouds
cluster
clusters
coals
coast
coat
coats
cock
cold
colossians
colour
colours
colt
come
comely
comest
cometh
comfort
comfortably
comforted
comforter
comforters
comforteth
coming
command
commanded
commandedst
commandeth
commandment
commandments
commend
commended
commit
committed
committeth
common
commune
communed
communion
companies
companion
companions
company
compared
compass
compassed
compassion
complain
complaint
complete
conceal
conceive
conceived
concerning
concubine
concubines
condemn
condemnation
condemned
confess
confessed
confession
confidence
confident
confirm
confirmed
confounded
confusion
congregation
conscience
consecrate
consecrated
consecration
consent
consider
considered
considereth
consolation
conspiracy
conspired
constrained
consulted
consume
consumed
contain
contempt
contemptible
contend
contended
content
contention
contentions
contentious
continual
continually
continue
continued
continueth
contrary
contrite
controversy
convocation
cool
copy
cord
cords
corinth
corinthians
corn
cornelius
corner
corners
cornet
correct
correction
corrupt
corrupted
corruptible
corruption
corruptly
costly
couch
could
council
counsel
counselled
counsellor
counsellors
counsels
count
counted
countenance
countries
country
couple
coupled
coupling
courage
course
courses
court
courts
covenant
cover
covered
covereth
covering
covert
covet
covetous
covetousness
cow
craftiness
craftsmen
create
created
creation
creator
creature
creatures
creep
creepeth
creeping
crete
crew
cried
crieth
crooked
cross
crow
crowd
crown
crowned
crowns
crucified
crucify
cruel
cruse
crush
crushed
cry
crying
crystal
cubit
cubits
cud
cunning
cunningly
cup
cups
cure
curse
cursed
curses
curseth
cursing
curtain
curtains
cush
cushite
custom
customs
cut
cutteth
cutting
cymbals
cyprus
cyrene
cyrus
dagon
daily
dam
damascus
damsel
dan
dance
dances
dancing
danger
daniel
danites
darics
darius
dark
darkened
darkness
dash
dashed
dathan
daubed
daughter
daughters
david
dawn
dawning
day
day-time
days
deacons
dead
deadly
deaf
deal
dealeth
dealt
death
debir
deborah
debt
debtor
debtors
deceit
deceitful
deceitfully
deceive
deceived
deceiver
deceiveth
decked
declare
declared
declaring
decree
dedan
dedicate
dedicated
dedication
deed
deeds
deep
deeper
deeps
defence
defenced
defend
deferred
defied
defile
defiled
defileth
defy
degree
delaiah
delicate
delicately
delight
delighted
delighteth
delilah
deliver
deliverance
delivered
deliverer
delivereth
den
denied
dens
deny
depart
departed
departeth
depth
depths
deputies
derision
descend
descended
descending
desert
deserts
desirable
desire
desired
desireth
desiring
desolate
desolation
desolations
despise
despised
despiseth
despite
destitute
destroy
destroyed
destroyer
destroyeth
destroying
destruction
determined
detestable
deuteronomy
device
devices
devil
devils
devise
devised
deviseth
devoted
devour
devoured
devoureth
devouring
devout
dew
diana
dibon
did
didst
die
died
dieth
difference
different
dig
digged
dignity
diligence
diligent
diligently
dim
diminish
dinah
dip
dipped
direct
discern
discerned
disciple
disciples
disclose
discomfited
discomfiture
discover
discovered
discretion
disease
diseases
disguised
dish
dishan
dishon
dishonour
dismayed
disobedience
disobedient
dispensation
disperse
dispersed
displeased
disquieted
dissolved
distinction
distress
distressed
distresses
distributed
district
divers
diverse
divide
divided
divination
divine
diviners
division
divisions
divorcement
do
doctrine
doeg
doer
doest
doeth
dog
dogs
doing
doings
dominion
done
door
doorkeepers
doors
dor
dost
doted
doth
double
doubt
dough
dove
doves
down
downward
dowry
drag
dragon
drank
draught
drave
draw
draweth
drawing
drawn
dread
dream
dreamed
dreams
dress
dressed
drew
dried
drink
drinketh
drinking
drive
driven
driving
drop
dropped
dross
drought
drove
drunk
drunkards
drunken
drunkenness
dry
due
duke
dukes
dumb
dung
dungeon
dunghill
during
durst
dust
duty
dwell
dwelled
dwellest
dwelleth
dwelling
dwellings
dwelt
dyed
dying
each
eagle
eagles
ear
early
earnest
earnestly
earrings
ears
earth
earthen
earthquake
ease
easier
east
eastward
eat
eaten
eateth
eating
ebal
ebed
ebed-melech
eber
ecclesiastes
eden
eder
edge
edifying
edom
edomite
edomites
edrei
effect
effectual
eggs
eglon
egypt
egyptian
egyptians
ehud
eight
eighteen
eighteenth
eighth
either
ekron
elah
elam
elath
elder
elders
eldest
elealeh
eleazar
elect
election
eleven
eleventh
eli
eliab
eliakim
eliasaph
eliashib
eliel
eliezer
elihu
elijah
elim
elimelech
elioenai
eliphaz
eliphelet
elisabeth
elisha
elishama
elizur
elkanah
elnathan
elon
else
embrace
embroiderer
emerald
emptied
empty
en-gedi
enan
encamp
encamped
enchanters
enchantments
enclosed
encourage
end
ended
ends
endure
endured
endureth
enemies
enemy
engravings
enjoy
enlarge
enlarged
enlightened
enmity
enoch
enosh
enough
ensample
ensign
enter
entered
entereth
entering
entice
entire
entrance
entreat
entreated
entry
envied
envy
ephah
ephesians
ephesus
ephod
ephraim
ephrath
ephrathah
ephron
epistle
equal
equity
er
ere
err
erred
error
esau
escape
escaped
escapeth
eshcol
eshtaol
eshtemoa
especially
establish
established
estate
esteemed
esther
estimation
estranged
etam
eternal
ethan
ethiopia
ethiopian
ethiopians
eunuch
eunuchs
euphrates
even
evening
eventide
ever
everlasting
evermore
every
everything
everywhere
evident
evil
evil-doers
evil-doing
evils
ewe
ewes
exact
exalt
exalted
exalteth
examined
example
exceeding
exceedingly
excellency
excellent
except
exchange
execute
executed
executeth
exercise
exercised
exhort
exhortation
exhorted
exhorting
exile
exodus
expectation
expedient
expressed
exult
eye
eyelids
eyes
ezekiel
ezer
ezion-geber
ezra
fables
face
faces
fade
fadeth
fail
failed
faileth
fain
faint
fainted
fainteth
fair
faith
faithful
faithfully
faithfulness
faithless
fall
fallen
falleth
falling
false
falsehood
falsely
fame
familiar
families
family
famine
famous
fan
far
fashion
fashioned
fast
fasted
fastened
fasting
fat
father
fatherless
fathers
fatlings
fatness
fatted
fault
favour
favoured
fear
feared
feareth
fearful
fearing
feast
feasting
feasts
fed
feeble
feed
feedeth
feeding
feel
feet
feigned
felix
fell
fellow
fellow-servant
fellow-worker
fellow-workers
fellows
fellowship
felt
female
fence
fenced
fervent
festus
fetch
fetched
fetters
fever
few
field
fields
fierce
fierceness
fiery
fifteen
fifteenth
fifth
fifties
fifty
fig
fight
fighting
figs
figure
fill
filled
filleth
fillets
filth
filthiness
filthy
finally
find
findeth
finding
fine
finger
fingers
finish
finished
fins
fir
fire
firepans
firm
firmament
first
firstborn
firstfruits
firstling
firstlings
firstripe
fish
fishers
fishes
fit
five
fixed
flame
flaming
flattereth
flattering
flax
fled
flee
fleece
fleeth
flesh
fleshhooks
flies
flieth
flight
flint
flock
flocks
flood
floods
floor
flour
flourish
flow
flower
flowers
flowing
fly
flying
foes
fold
folds
follow
followed
followeth
following
folly
food
fool
foolish
foolishly
foolishness
fools
foot
footmen
footsteps
footstool
for
forasmuch
forbear
forbearing
forbid
force
forced
forces
fords
forefront
forehead
foreheads
foreigner
foreordained
forepart
foreskin
foreskins
forest
forgat
forgave
forget
forgetteth
forgive
forgiven
forgotten
form
formed
former
fornication
fornicators
forsake
forsaken
forsaketh
forsook
forth
forthwith
fortress
fortresses
forts
forty
forward
fought
found
foundation
foundations
founded
fountain
fountains
four
fourscore
foursquare
fourteen
fourteenth
fourth
fowl
fowls
foxes
frame
framed
frankincense
free
freedom
freely
freewill
fresh
fret
friend
friends
fro
frogs
from
front
frost
froward
fruit
fruitful
fruits
fuel
fugitives
fulfill
fulfilled
full
fully
fulness
furbished
furlongs
furnace
furnished
furniture
furrows
further
furthermore
fury
gaal
gad
gadites
gain
gained
gainsaying
gaius
galatia
galatians
galilaeans
galilee
gall
gallows
gamaliel
garden
gardens
garment
garments
garrison
garrisons
gat
gate
gates
gath
gather
gathered
gathereth
gathering
gave
gavest
gaza
geba
gedaliah
gedor
gehazi
gemariah
genealogies
genealogy
generation
generations
genesis
gentiles
gentle
gera
gerahs
gerar
gershom
gershon
gershonites
geshur
geshurites
get
getteth
gezer
ghost
giant
gibbethon
gibeah
gibeon
gibeonites
gideon
gideoni
gift
gifts
gihon
gilboa
gilead
gileadite
gilgal
gird
girded
girdle
girdles
girgashite
girt
gittite
give
given
givest
giveth
giving
glad
gladly
gladness
glean
gleaned
gleaning
glorified
glorify
glorious
glory
glorying
gnashing
go
goat
goats
god
godless
godliness
godly
gods
goest
goeth
gog
going
goings
gold
golden
goldsmith
goliath
gomer
gomorrah
gone
good
goodly
goodness
goods
goshen
gospel
gotten
gourd
governor
governors
gozan
grace
gracious
graciously
grafted
grain
grant
granted
grape
grapes
grass
grating
grave
graven
graves
gray
great
greater
greatest
greatly
greatness
greece
greedy
greek
greeks
green
greeting
grew
grief
grieved
grievous
grievously
grind
groan
groaning
grope
ground
grow
groweth
grown
guard
guests
guide
guided
guile
guilt
guiltiness
guiltless
guilty
gushed
habakkuk
habitation
habitations
had
hadad
hadadezer
hadarezer
hades
hadst
hagar
haggai
haggith
hail
hailstones
hair
hairs
hairy
hakkoz
half
hallow
hallowed
halt
ham
haman
hamath
hammedatha
hammer
hamor
hanan
hanani
hananiah
hand
handbreadth
handful
handfuls
handle
handmaid
handmaids
hands
hang
hanged
hanging
hangings
hannah
hanoch
hanun
haply
happen
happened
happeneth
happy
haran
hard
harden
hardened
hardly
hardness
harim
harlot
harlots
harm
harp
harps
hart
harvest
hashabiah
hashum
hasshub
hast
haste
hasted
hastened
hasteth
hastily
hasty
hate
hated
hatest
hateth
hath
hatred
hattush
haughty
have
haven
havilah
having
hawk
hazael
hazeroth
hazor
he
he-goat
he-goats
he-lamb
he-lambs
head
heads
headtires
heal
healed
healeth
healing
health
heap
heaps
hear
heard
heardest
hearest
heareth
hearing
hearken
hearkened
hearkeneth
heart
hearted
hearts
heat
heathen
heave
heaven
heavenly
heavens
heavier
heaviness
heavy
heber
hebrew
hebrews
hebron
hebronites
hedge
heed
heel
heifer
height
heights
heir
heirs
held
helez
hell
helmet
helon
help
helped
helper
helpers
helpeth
heman
hence
henceforth
hepher
her
herb
herbs
herd
herdmen
herds
here
hereafter
hereby
herein
heretofore
heritage
hermon
herod
herodias
herself
heshbon
heth
hew
hewed
hewers
hewn
hezekiah
hezron
hid
hidden
hide
hidest
hideth
hiding
high
higher
highest
highly
highway
highways
hilkiah
hill
hills
him
himself
hin
hinder
hindered
hinds
hinnom
hiram
hire
hired
hireling
his
hiss
hissing
history
hither
hitherto
hittite
hittites
hivite
hivites
ho
hoar
hoary
hodiah
hold
holden
holdest
holdeth
holding
holds
hole
holes
holiness
hollow
holpen
holy
home
homeborn
homer
honey
honeycomb
honour
honourable
honoured
honoureth
hoof
hoofs
hook
hooks
hope
hoped
hophni
hor
hordes
horeb
horites
hormah
horn
horns
horrible
horror
horse
horsemen
horses
hosah
hosanna
hosea
hoshea
hospitality
host
hosts
hot
hour
house
household
householder
households
houses
housetop
housetops
how
howbeit
howl
howling
humble
humbled
humbleth
humility
hundred
hundredfold
hundreds
hunger
hungred
hungry
hunt
hur
huram
hurt
husband
husbandman
husbandmen
husbands
hushai
hushathite
hypocrisy
hypocrites
hyssop
i
iconium
iddo
idle
idol
idolaters
idols
if
ignorance
ignorant
ill
image
images
imagination
imagine
imitators
immediately
immer
impossible
impurity
in
inasmuch
incense
incline
inclined
incorruptible
incorruption
increase
increased
increaseth
incurable
indeed
indignation
infirmities
infirmity
informed
inhabit
inhabitant
inhabitants
inhabited
inherit
inheritance
iniquities
iniquity
injustice
inner
innermost
innocency
innocent
innumerable
inquire
inquired
insomuch
instant
instead
instruct
instructed
instruction
instrument
instruments
insurrection
integrity
intent
intercession
interdict
interpret
interpretation
interpreted
into
intrusted
invisible
inward
inwardly
inwards
ira
iron
is
isaac
isaiah
iscariot
ish-bosheth
ishi
ishmael
ishmaelites
island
islands
isle
isles
israel
israelites
issachar
isshiah
issue
it
ithamar
its
itself
ittai
ivory
izhar
jabbok
jabesh
jabesh-gilead
jabin
jachin
jackals
jacob
jael
jahath
jahaz
jahaziel
jair
james
jamin
japheth
japhia
jared
jarmuth
jason
jasper
javan
javelin
jaws
jazer
jealous
jealousy
jebusite
jebusites
jeconiah
jedaiah
jediael
jeduthun
jehiel
jehoahaz
jehoash
jehohanan
jehoiachin
jehoiada
jehoiakim
jehoram
jehoshaphat
jehovah
jehozadak
jehu
jeiel
jeopardy
jephthah
jephunneh
jerahmeel
jeremiah
jeremoth
jericho
jerimoth
jeroboam
jeroham
jerubbaal
jerusalem
jeshaiah
jeshua
jesse
jesus
jether
jethro
jeush
jew
jewels
jews
jezebel
jezreel
jezreelite
jezreelitess
joab
joah
joash
job
jobab
joel
johanan
john
joiada
joiarib
join
joined
joints
joktan
jonadab
jonah
jonathan
joppa
joram
jordan
joseph
joshua
josiah
jotham
journey
journeyed
journeys
joy
joyful
joyous
jozabad
jozadak
jubile
judaea
judah
judas
jude
judge
judged
judges
judgest
judgeth
judging
judgment
judgment-seat
judgments
just
justice
justified
justify
kadesh
kadesh-barnea
kadmiel
kareah
kedar
kedesh
keep
keeper
keepers
keepeth
keeping
keilah
kenan
kenaz
kenite
kenites
kept
key
kibroth-hattaavah
kid
kidneys
kidron
kids
kill
killed
killeth
kin
kind
kindle
kindled
kindly
kindness
kindred
kinds
kine
king
kingdom
kingdoms
kings
kinsman
kinsmen
kir
kiriath-arba
kiriath-jearim
kiriathaim
kirjath-jearim
kish
kishon
kiss
kissed
kittim
knee
kneeled
knees
knew
knewest
knit
knives
knop
knops
know
knowest
knoweth
knowing
knowledge
known
kohath
kohathites
korah
korahites
laban
labour
laboured
labourers
laboureth
labours
lachish
lack
lacked
lacketh
lacking
lad
ladan
laden
laid
lain
laish
lake
lamb
lambs
lame
lamech
lament
lamentation
lamentations
lamented
lamp
lamps
land
landmark
lands
language
languages
languish
languisheth
laodicea
large
lasciviousness
last
late
latter
laugh
laughed
laughter
laver
law
lawful
laws
lawyers
lay
layeth
laying
lazarus
lead
leadeth
leaf
league
leah
lean
leaned
leap
leaped
learn
learned
learning
least
leave
leaven
leavened
leaves
leaveth
leaving
lebanon
led
left
legs
lend
length
lent
leopard
leper
lepers
leprosy
leprous
less
lest
let
letter
letters
levi
leviathan
levite
levites
leviticus
levy
lewdness
liar
liberal
liberty
libnah
libni
lice
lick
lie
liers
lies
liest
lieth
life
lift
lifted
lifteth
lifting
light
lighted
lighten
lightened
lighter
lightly
lightning
lightnings
lights
like
liken
likened
likeness
likewise
lilies
lily
line
linen
lion
lioness
lions
lips
little
live
lived
liver
lives
liveth
living
lo
loaf
loathe
loaves
locks
locust
locusts
lodge
lodged
lodges
lodging
lofty
log
loins
long
longed
longer
longing
longsuffering
look
looked
looketh
looking
loops
loose
loosed
lord
lords
lose
loss
lost
lot
lotan
lots
loud
love
loved
lovedst
lovers
lovest
loveth
lovingkindness
low
lower
lowest
lowland
lowly
lucre
lud
luke
lump
lust
lusted
lusts
luz
lying
lystra
maacah
maaseiah
macedonia
machir
machpelah
mad
made
madest
madness
magdalene
magicians
magistrates
magnified
magnify
magog
mahalalel
mahanaim
mahlah
mahli
maid
maiden
maidens
maidservant
maidservants
mail
maimed
maintain
majesty
make
maker
makest
maketh
making
makkedah
malachi
malchijah
male
males
malice
malluch
mamre
man
manasseh
mandrakes
manifest
manifested
manifold
mankind
manna
manner
manoah
manservant
manslayer
mantle
many
maon
mar
marah
marble
march
mareshah
mariners
mark
marked
marketplace
marketplaces
marriage
married
marrieth
marrow
marry
martha
marvel
marveled
marvelous
mary
maschil
masons
massah
master
masters
mattaniah
matter
matters
matthew
mattithiah
may
mayest
me
meal
mean
meaneth
means
measure
measured
measures
measuring
meat
meats
medeba
medes
media
mediator
meditate
meditation
meek
meekness
meet
meeting
megiddo
melchizedek
melody
melt
melted
melteth
member
members
memorial
memory
men
menahem
menservants
mention
mentioned
mephibosheth
meraioth
merari
merchandise
merchant
merchants
mercies
merciful
mercy
mercy-seat
meremoth
meribah
merry
meshach
meshech
meshullam
mesopotamia
message
messenger
messengers
met
mete
methuselah
mica
micah
micaiah
michael
michal
michmash
michtam
middle
midian
midianites
midnight
midst
midwives
might
mightest
mightier
mightily
mighty
milcah
mildew
milk
millo
millstone
mind
minded
mindful
minds
mine
mingled
minister
ministered
ministering
ministers
ministration
ministry
miracles
mire
miriam
mirth
mischief
mischievous
misery
mishael
mistress
mitre
mixed
mizpah
mizpeh
moab
moabites
moabitess
mock
mocked
mocketh
mocking
molech
molten
moment
money
month
months
moon
moons
mordecai
more
moreover
morning
morrow
morsel
mortal
mortar
moses
most
mote
moth
mother
mothers
mount
mountain
mountains
mounted
mourn
mourned
mourneth
mourning
mouth
mouths
move
moved
moveth
moza
much
mule
mules
multiplied
multiplieth
multiply
multitude
multitudes
murder
murderer
murderers
murmur
murmured
murmurings
mushi
music
musician
must
mustard
mustered
my
myrrh
myrtle
myself
mysteries
mystery
naamah
naaman
nabal
naboth
nadab
nahash
nahath
nahor
nahshon
nahum
nail
nails
naioth
naked
nakedness
name
named
namely
names
naomi
naphtali
narrow
nathan
nathanael
nation
nations
nativity
natural
nature
navy
nay
nazareth
nazirite
near
nebaioth
nebat
nebo
nebuchadnezzar
nebuchadrezzar
nebuzaradan
necessary
necessity
neck
necks
need
needeth
needful
needs
needy
nehemiah
neighbour
neighbours
neither
ner
neriah
nest
net
nethanel
nethaniah
nether
nethinim
netophathite
nets
nettles
network
never
nevertheless
new
next
nicodemus
nigh
night
nights
nile
nimshi
nine
ninety
nineveh
ninth
no
noah
nob
noble
nobles
noise
none
noon
noonday
noph
nor
north
northward
nose
nostrils
not
notable
nothing
notwithstanding
nought
nourish
nourished
now
number
numbered
numbering
numbers
nun
nurse
o
oak
oaks
oath
oaths
obadiah
obed
obed-edom
obedience
obedient
obeisance
obey
obeyed
oblation
oblations
observe
observed
obtain
obtained
occasion
occasions
ochran
of
off
offence
offended
offer
offered
offereth
offering
offerings
office
officer
officers
offspring
oft
often
oftentimes
og
oh
oholah
oholiab
oholibah
oholibamah
oil
ointment
old
olive
olives
oliveyards
omri
on
onan
once
one
ones
only
ono
onward
onyx
open
opened
openeth
opening
openly
ophel
ophir
ophrah
opportunity
oppress
oppressed
oppresseth
oppression
oppressor
oppressors
or
oracle
ordain
ordained
order
ordinance
ordinances
oreb
ornaments
ornan
ostriches
other
others
otherwise
othniel
ouches
ought
our
ours
ourselves
out
outcasts
outer
outermost
outmost
outside
outward
oven
over
overcome
overcometh
overflow
overflowing
overlaid
overlay
overseer
overseers
oversight
overtake
overthrew
overthrow
overthrown
overtook
overwhelmed
owl
own
owner
ox
oxen
paddan-aram
pagiel
pahath-moab
paid
pain
pained
palace
palaces
pallu
palm
palms
palsied
palsy
pamphylia
pan
pangs
parable
parables
paran
parched
pardon
parents
parosh
part
partake
partaker
partakers
parted
parteth
parting
partly
parts
pashhur
pass
passed
passeth
passing
passions
passover
past
pasture
pastures
path
pathros
paths
patience
patient
patiently
pattern
paul
pavement
pavilion
pay
peace
peaceable
peaceably
pearls
peculiar
pedahzur
pedaiah
pekah
pelatiah
peleg
pelethites
pelican
pen
pence
penny
penuel
people
peoples
peor
peradventure
perceive
perceived
perceiving
perdition
perez
perfect
perfected
perfection
perform
performed
perils
perish
perished
perisheth
perishing
perizzite
perizzites
perpetual
perplexed
persecute
persecuted
persecutest
persecution
persecutions
persecutors
persia
persians
person
persons
persuade
persuaded
pertain
pertained
pertaineth
pertaining
perverse
perversely
perverseness
pervert
perverted
pestilence
peter
petition
pharaoh
pharisee
pharisees
philemon
philip
philippi
philippians
philistia
philistine
philistines
phinehas
physician
physicians
piece
pieces
pierce
pierced
pigeons
pilate
pillar
pillars
pine
pinions
pins
pipe
pipes
pirathonite
pisgah
pit
pitch
pitched
pitcher
pitchers
pitied
pits
pity
place
placed
places
plague
plagued
plagues
plain
plainly
plains
plaister
planks
plant
planted
planteth
plants
play
played
playing
plead
pleasant
please
pleased
pleaseth
pleasing
pleasure
pleasures
pledge
plenteous
plenty
plot
plow
plowed
plowing
pluck
plucked
point
poison
polled
polls
polluted
pomegranate
pomegranates
pool
pools
poor
poorest
porch
porter
porters
portion
portions
possess
possessed
possession
possessions
possible
post
posts
pot
pots
pottage
potter
pound
pounds
pour
poured
poureth
poverty
powder
power
powers
practise
praise
praised
praises
praising
pray
prayed
prayer
prayers
prayeth
praying
preach
preached
preacher
preaching
precept
precepts
precious
preparation
prepare
prepared
presence
present
presented
presents
preserve
preserved
preserveth
presidents
press
pressed
presumptuously
prevail
prevailed
prey
price
pride
priest
priesthood
priests
prince
princes
principal
principalities
prison
prisoner
prisoners
privately
privily
proceed
proceeded
proceedeth
proclaim
proclaimed
proclamation
profane
profaned
profit
profitable
profited
profiteth
prolong
prolonged
promise
promised
promises
promote
pronounce
pronounced
proof
prophecy
prophesied
prophesieth
prophesy
prophesying
prophet
prophetess
prophets
prospect
prosper
prospered
prosperity
prosperous
proud
proudly
prove
proved
provender
proverb
proverbs
provide
provided
province
provinces
proving
provision
provocation
provoke
provoked
prudence
prudent
psalm
psalms
psalteries
psaltery
publican
publicans
publish
published
puffed
pull
punish
punished
punishment
purchase
purchased
pure
purge
purged
purification
purified
purify
purifying
purim
purple
purpose
purposed
purposes
purse
pursue
pursued
pursuers
pursueth
pursuing
push
put
puttest
putteth
putting
quarter
queen
quench
quenched
question
questioning
questions
quick
quicken
quickened
quickeneth
quickly
quiet
quietness
quit
quiver
rabbah
rabbi
rabshakeh
race
rachel
rage
raging
rahab
raid
railing
raiment
rain
rained
raise
raised
raiseth
raisins
ram
ramah
ramoth
ramoth-gilead
rams
ran
ranks
ransom
rash
rather
raven
ravenous
ravens
ravished
raw
razor
reach
reached
reacheth
reaching
read
readiness
reading
ready
realm
reap
reapers
rear
reared
rearward
reason
reasoned
reasoning
rebekah
rebel
rebelled
rebellion
rebellious
rebuke
rebuked
receive
received
receiveth
receiving
rechab
reckon
reckoned
reckoning
recompence
recompense
recompensed
reconciled
recorder
recover
recovered
red
redeem
redeemed
redeemer
redemption
reed
reeds
refined
refrain
refrained
refresh
refreshed
refuge
refuse
refused
refuseth
regard
regarded
regardeth
region
regions
rehabiah
rehearsed
rehob
rehoboam
rehum
reign
reigned
reigneth
reins
reject
rejected
rejecteth
rejoice
rejoiced
rejoiceth
rejoicing
rekem
release
released
religion
remain
remained
remaineth
remaining
remaliah
remember
remembered
remembereth
remembrance
remission
remnant
remove
removed
removing
rend
render
rendered
renew
renewed
renown
rent
repair
repaired
repay
repent
repentance
repented
repenteth
rephaiah
rephaim
rephidim
report
reported
reproach
reproached
reproacheth
reprobate
reproof
reprove
reproved
reproveth
request
requested
require
required
requite
rescue
rescued
rescueth
reserved
residue
respect
rest
rested
resting
restitution
restore
restored
restrained
resurrection
retain
return
returned
returneth
returning
reu
reuben
reubenites
reuel
reveal
revealed
revealeth
revelation
reverence
reviling
revive
revived
revolted
reward
rewarded
rezin
riblah
rich
riches
riddle
ride
rider
rideth
riding
right
righteous
righteously
righteousness
rigour
rimmon
ring
rings
ringstraked
ripe
rise
risen
riseth
rising
river
rivers
roar
roared
roaring
roast
rob
robbed
robber
robbers
robbery
robe
robes
rock
rocks
rocky
rod
rode
rods
roe
roll
rolled
roman
romans
rome
roof
room
root
rooted
roots
ropes
rose
rottenness
rough
roughly
round
row
rows
royal
rubies
rudiments
ruin
ruins
rule
ruled
ruler
rulers
ruleth
rumour
run
runneth
running
rush
rushed
rushing
rust
ruth
s
sabbath
sabbaths
sack
sackcloth
sacks
sacrifice
sacrificed
sacrifices
sacrificeth
sad
saddled
sadducees
safe
safely
safety
said
saidst
sail
sailed
saints
saith
sake
sakes
salmon
salt
salutation
salute
saluted
saluteth
salvation
samaria
samaritan
samaritans
same
samson
samuel
sanballat
sanctification
sanctified
sanctify
sanctuaries
sanctuary
sand
sang
sapphire
sarah
sarai
sardius
sat
satan
satisfied
satisfy
satraps
saul
save
saved
saveth
saving
saviour
savour
savoury
saw
sawest
say
sayest
saying
sayings
scab
scales
scall
scarlet
scatter
scattered
scattereth
sceptre
scorched
scorching
scorn
scorner
scorners
scorpions
scourge
screen
scribe
scribes
scripture
scriptures
sea
seal
sealed
seals
sealskin
sealskins
search
searched
searcheth
seas
season
seasons
seat
seats
second
secret
secretly
secrets
sect
secure
securely
security
see
seed
seeds
seeing
seek
seekest
seeketh
seeking
seem
seemed
seemeth
seemly
seen
seer
seest
seeth
seethe
seir
seize
seized
selah
self
selfsame
sell
selleth
selves
send
sendest
sendeth
sending
sennacherib
sent
sentence
separate
separated
separateth
separation
sepharvaim
sepulchre
sepulchres
seraiah
serpent
serpents
serug
servant
servants
serve
served
serveth
service
servile
serving
set
seth
settest
setteth
setting
settle
settled
seven
sevenfold
seventeen
seventeenth
seventh
seventy
several
severally
shadow
shadrach
shaft
shake
shaken
shaketh
shaking
shall
shallum
shalt
shame
shameful
shamefully
shammah
shammai
shammua
shaphan
shaphat
sharon
sharp
shaul
shave
shaved
shaven
she
she-asses
sheaf
shealtiel
sheath
sheaves
sheba
shebaniah
shebna
shecaniah
shechem
shed
shedeur
sheep
sheepfolds
shekel
shekels
shelah
shelemiah
shelomith
shelomoth
shelumiel
shem
shema
shemaiah
sheol
shephatiah
shepherd
shepherds
sherebiah
sheshan
shew
shewbread
shewed
sheweth
shewing
shewn
shield
shields
shiloh
shilonite
shimea
shimei
shimron
shinar
shine
shined
shineth
shining
ship
ships
shishak
shittim
shobal
shoe
shoes
shone
shook
shoot
shore
short
shortened
shortly
shot
should
shoulder
shoulderpieces
shoulders
shouldest
shout
shouted
shouting
shovels
shower
showers
shuhite
shunammite
shur
shushan
shut
shutteth
sibmah
sick
sickle
sickness
side
side-chambers
sides
sidon
siege
sigh
sighing
sight
sign
signet
signified
signs
sihon
silas
silence
silent
silver
simeon
simon
simple
sin
sinai
since
sincerity
sinful
sing
singers
singing
sink
sinned
sinner
sinners
sinneth
sins
sir
sirs
sisera
sister
sisters
sit
sittest
sitteth
sitting
six
sixteen
sixth
sixty
skies
skilful
skill
skin
skins
skirt
skirts
skull
slack
slain
slaughter
slay
slayeth
slaying
sleep
sleepeth
sleeping
slept
slew
sling
slipped
slopes
slothful
slow
sluggard
slumber
small
smell
smite
smiteth
smiths
smiting
smitten
smoke
smoking
smooth
smote
snare
snared
snares
snow
snuffers
so
sober
soberminded
sockets
socoh
sodden
sodom
soever
soft
softly
sojourn
sojourned
sojourner
sojourners
sojourneth
sojourning
sojournings
sold
soldier
soldiers
sole
solemn
soles
solitary
solomon
some
something
somewhat
son
song
songs
sons
soon
soothsayers
sorcerers
sore
sorrow
sorrowful
sorrows
sorry
sort
sought
soul
souls
sound
sounded
sounding
south
southward
sow
sowed
sower
soweth
sowing
sown
space
spake
spakest
span
spare
spared
spareth
speak
speakest
speaketh
speaking
spear
spears
specially
speckled
speech
speed
speedily
spend
spent
spices
spied
spies
spikenard
spirit
spirits
spiritual
spit
spoil
spoiled
spoiler
spoilers
spoileth
spoiling
spoken
spoon
spoons
sport
spot
spots
spotted
sprang
spread
spreadeth
spreading
spring
springeth
springing
springs
sprinkle
sprinkled
spy
stablish
stablished
staff
stairs
stamped
stand
standard
standest
standeth
standing
star
stars
state
stature
statute
statutes
staves
stay
stayed
stays
stead
steal
stedfast
stedfastly
steep
stephen
steps
steward
stick
sticks
stiff
stiffnecked
still
stink
stir
stirred
stirreth
stock
stocks
stole
stolen
stone
stoned
stones
stood
stop
stopped
store
storehouses
stories
stork
storm
stormy
straight
straightway
strait
straitened
straitly
straitness
strange
stranger
strangers
straw
stream
streams
street
streets
strength
strengthen
strengthened
stretch
stretched
stretcheth
stricken
strife
strike
stringed
strip
stripes
stripped
strive
striving
stroke
strong
stronger
strove
struck
stubble
stubborn
stubbornness
stuff
stumble
stumbled
stumbleth
stumbling
stumblingblock
subdue
subdued
subject
subjected
subjection
submit
substance
subtilty
suburbs
succoth
succour
such
suck
sucking
sudden
suddenly
suffer
suffered
suffereth
suffering
sufferings
suffice
sufficient
suit
sum
summer
sun
sun-images
sunder
sunk
sunrising
superscription
supper
supplication
supplications
supply
suppose
supposed
supposing
sure
surely
surety
surnamed
sustain
swallow
swallowed
sware
swarest
swarms
swear
sweareth
sweep
sweet
sweetness
swell
swept
swift
swifter
swiftly
swim
swine
sword
swords
sworn
sycomore
synagogue
synagogues
syria
syrian
syrians
taanach
tabernacle
tabernacles
table
tables
tabor
tahath
tahpanhes
tail
tails
take
taken
takest
taketh
taking
tale
talent
talents
talk
talked
talking
tall
talmai
talmon
tamar
tappuah
tares
tarried
tarry
tarshish
tarsus
taskmasters
taskwork
taste
tasted
taught
teach
teacher
teachers
teachest
teacheth
teaching
tear
tears
teeth
tekoa
tell
telleth
telling
tema
teman
temanite
temperate
tempest
temple
temples
tempt
temptation
temptations
tempted
tempting
ten
tender
tendeth
tenons
tent
tenth
tents
terah
teraphim
terrible
terror
terrors
testified
testify
testifying
testimonies
testimony
tetrarch
than
thank
thanks
thanksgiving
that
the
thee
their
theirs
them
themselves
then
thence
there
thereby
therefore
therefrom
therein
thereof
thereon
thereto
therewith
these
thessalonians
thessalonica
they
thick
thief
thieves
thigh
thin
thine
thing
things
think
thinkest
thinketh
third
thirst
thirsty
thirteen
thirteenth
thirtieth
thirty
this
thistle
thistles
thither
thomas
thorn
thorns
those
thou
though
thought
thoughts
thousand
thousands
thread
three
threescore
threshing
threshing-floor
threshold
thresholds
threw
thrice
throat
throne
thrones
through
throughly
throughout
throw
thrown
thrust
thumb
thummim
thunder
thunders
thus
thy
thyself
tidings
tied
till
timber
timbrel
timbrels
time
times
timna
timnah
timothy
tin
tip
tirshatha
tirzah
tishbite
tithe
tithes
titus
to
to-night
tobiah
today
toe
toes
together
toil
token
tokens
tola
told
tolerable
toll
tomb
tombs
tomorrow
tongs
tongue
tongues
too
took
tooth
top
topaz
topheth
tops
torches
torment
tormented
torn
tossed
touch
touched
toucheth
touching
toward
towards
tower
towers
towns
trade
traded
tradition
traffic
traffickers
train
trample
transgress
transgressed
transgression
transgressions
transgressor
transgressors
trap
travail
travailed
travaileth
treacherous
treacherously
tread
treadeth
treason
treasure
treasures
treasuries
treasury
tree
trees
tremble
trembled
trembleth
trembling
trespass
trespassed
trespasses
trial
tribe
tribes
tribulation
tributary
tribute
tried
triumph
troas
trodden
trode
troop
troops
trouble
troubled
troubles
troubleth
true
truly
trumpet
trumpets
trust
trusted
trustest
trusteth
truth
try
tubal
tumours
tumult
turn
turned
turnest
turneth
turning
turtledoves
twain
twelfth
twelve
twentieth
twenty
twice
twilight
twined
twins
two
two-edged
tychicus
tyre
unawares
unbelief
unbelieving
uncircumcised
uncircumcision
uncle
unclean
uncleanness
uncover
uncovered
undefiled
under
underneath
understand
understandest
understandeth
understanding
understood
undone
unfruitful
ungodliness
ungodly
unjust
unleavened
unless
unprofitable
unpunished
unrighteous
unrighteousness
unsearchable
untempered
until
unto
unwittingly
up
uphold
upholdeth
upon
upper
upright
uprightly
uprightness
uproar
upside
upward
ur
urged
urgent
uri
uriah
urijah
urim
us
use
used
useth
usury
utmost
utter
utterance
uttered
uttereth
utterly
uttermost
uz
uzza
uzzah
uzzi
uzziah
uzziel
vain
vale
valiant
valiantly
valley
valleys
valour
value
vanities
vanity
vapour
vashti
veil
veiled
vengeance
venison
verily
very
vessel
vessels
vesture
vex
vexation
vexed
victory
victual
victuals
vile
village
villages
vine
vinedressers
vinegar
vines
vineyard
vineyards
vintage
violence
violent
violently
virgin
virginity
virgins
vision
visions
visit
visitation
visited
voice
voices
void
vomit
vow
vowed
voweth
vows
wafers
wages
wagons
wailing
wait
waited
waiteth
waiting
walk
walked
walkest
walketh
walking
wall
wallet
walls
wander
wandered
wandereth
wandering
want
wanting
war
ward
wares
warfare
warm
warming
warn
warned
warning
warp
warred
wars
was
wash
washed
washing
wast
waste
wasted
wasteth
watch
watched
watching
watchman
watchmen
water
watercourses
watered
watereth
waters
wave
waved
waves
wax
waxed
waxen
way
wayfaring
ways
we
weak
weakness
wealth
weaned
weapon
weapons
wear
wearied
weary
weaver
week
weeks
weep
weeping
weigh
weighed
weight
weights
welfare
well
well-doing
well-pleasing
wells
went
wentest
wept
were
west
westward
wet
what
whatsoever
wheat
wheel
wheels
whelps
when
whence
whensoever
where
whereas
whereby
wherefore
wherein
whereof
whereon
wheresoever
whereunto
whereupon
wherewith
whether
which
while
whiles
whilst
whirling
whirlwind
whit
white
whither
whithersoever
who
whole
wholly
whom
whomsoever
whoredom
whoredoms
whoring
whose
whoso
whosoever
why
wicked
wickedly
wickedness
wide
widow
widowhood
widows
wife
wild
wild-ox
wilderness
will
willeth
willing
willingly
willows
wilt
wind
window
windows
winds
wine
winepress
wineskins
wing
winged
wings
winter
wipe
wiped
wisdom
wise
wisely
wiser
wish
wist
wit
with
withal
withdraw
withdrawn
withdrew
wither
withered
withereth
withheld
withhold
withholden
within
without
withstand
withstood
witness
witnessed
witnesses
wives
wizards
woe
wolf
wolves
woman
womb
women
wonder
wondered
wonderful
wonders
wondrous
wont
wood
woof
wool
word
words
work
workers
worketh
working
workman
workmanship
workmen
works
world
worm
wormwood
worse
worship
worshipped
worshippers
worshippeth
worshipping
worth
worthily
worthy
wot
would
wouldest
wound
wounded
wounds
woven
wrapped
wrath
wreathen
wrest
write
writing
written
wrong
wronged
wrongfully
wrote
wroth
wrought
ye
yea
year
yearly
years
yellow
yesterday
yet
yield
yielded
yielding
yoke
yonder
you
you-ward
young
younger
youngest
your
yours
yourselves
youth
youths
zabad
zabdi
zaccur
zacharias
zadok
zalmunna
zanoah
zeal
zealous
zebadiah
zebah
zebedee
zebul
zebulun
zechariah
zedekiah
zeeb
zelophehad
zephaniah
zerah
zerahiah
zerahites
zerubbabel
zeruiah
ziba
zibeon
zichri
zidon
zidonians
ziklag
zilpah
zimri
zin
zion
ziph
zippor
zoan
zoar
zobah
zorah
zuar
zur
zurishaddai
